/* 
Redux
자바스크립트로 만든 애플리케이션들을 위한 예측 가능한 상태의 저장소.

- 소프트웨어를 개발할때 우리를 위협하는 간장 큰 위험은 "복잡성"입니다.
"복잡성"이 위험한 이유는 눈에 보이지 않기때문입니다.

복잡성은 슬럼프 랩 밭을 기도하고 또 개발자와 경영자의 사이를 멀어지게 
이간질하기 도합니다. 또 엄청난 자본과 인력을 투입한 차세대 프로젝트들이
실패로 돌아가는 것도 눈에 보이지 않는 "복잡성" 때문.

우리는 코드의 복잡성을 낮추고 더욱 복잡한 애플리케이션을 만드는데 도전.

- 리덕스는 애플리케이션의 복잡성을 획기적으로 낮춰서 우리의 코드가
어떤 결과를 가져올지 예측 가능하게 만들어주는 환상적인 도구.
*/

/* 
Redux의 특징
단 하나의 진실의 원천이라 부르는 개념.
하나의 상태를 갖는다. 상태 = 하나의 객체

하나의 객체 안에 애플리케이션에서 필요한 모든 데이터를 끼어넣는다.
이를 통해 리덕스 애플리케이션의 복잡성을 한번 낮춘다.

한곳에 데이터를 중앙 집중적으로 관리하면 아무래도 여러 곳에 흩어져 있는
것보다 훨씬 더 데이터를 관리하기가 쉬워집니다.
*/
